package day04;

/**
 *  需求：在控制台输出所有的"水仙花数“
 *      水仙花数：指的是一个三位数，个位、十位、百位的数字立方和等于原数
 *      153 3*3*3 + 5*5*5 + 1*1*1 = 153
 *
 *      扩展：每一行打印两个水仙花数
 */
public class Test2 {
    public static void main(String[] args) {
        int a,b,c,k = 0;//实现每行打印两个水仙花数，用k来定义打印过的水仙花的数量
//        //统计思想
//            for (int i = 100; i <= 999; i++) {
//                a = i / 100;//获取百位数
//                b = (i - (a * 100)) / 10;//获取十位数
//                c = i % 10;//获取个位数
//                if (i == ((a * a * a) + (b * b * b) + (c * c * c))) {
//                        System.out.print("水仙花数为：" + i + "  ");//输出值并换行，不想让他换行，去掉println中的ln
//                        k++;
//                        //在每一次确定一个水仙花数的时候自增一，然后判断是否达到了2的倍数，如果是则换行
//                        if(k % 2 == 0){
//                            //换行
//                            System.out.println();//直接换行
//                        }
//                }
//            }
//        System.out.println("当前的水仙花数共有" + k + "个");
        int i = 100;
        while (i <= 999) {
            a = i / 100;//获取百位数
            b = (i - (a * 100)) / 10;//获取十位数
            c = i % 10;//获取个位数
            if (i == ((a * a * a) + (b * b * b) + (c * c * c))) {
                System.out.print("水仙花数为：" + i + "  ");//输出值并换行，不想让他换行，去掉println中的ln
                k++;
                //在每一次确定一个水仙花数的时候自增一，然后判断是否达到了2的倍数，如果是则换行
                if (k % 2 == 0) {
                    //换行
                    System.out.println();//直接换行
                }
            }
            i++;
        }
        }
}